# TableCellStyle Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableCellStyle Methods
TableCellStyle Class See Also
---
The TableCellStyle type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCellStyleOverrideOptions | Gets cell style override options of this cell. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ResetOverride | Resets any overrides applied to this cell. |
| SetCellStyleOverrideOptions | Sets cell style override options of this cell. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TableCellStyle Class
Autodesk.Revit.DB Namespace